In [2]:
string_data = pd.Series([Series(['aardvark', 'artichoke', np.nan, 'avocado'])

SyntaxError: unexpected EOF while parsing (<ipython-input-2-6d04b7440be5>, line 1)

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

import pandas as pd
import numpy as np

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.214695       NaN       NaN
1  1.791361       NaN       NaN
2 -0.315750       NaN -0.855043
3 -1.092719       NaN -1.788691
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [14]:
df.dropna()

          0         1         2
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [15]:
df.dropna(thresh=2)

          0         1         2
2 -0.315750       NaN -0.855043
3 -1.092719       NaN -1.788691
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [16]:
df.fillna(0)

          0         1         2
0  0.214695  0.000000  0.000000
1  1.791361  0.000000  0.000000
2 -0.315750  0.000000 -0.855043
3 -1.092719  0.000000 -1.788691
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [17]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.214695  0.500000  0.000000
1  1.791361  0.500000  0.000000
2 -0.315750  0.500000 -0.855043
3 -1.092719  0.500000 -1.788691
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [18]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.214695  0.000000  0.000000
1  1.791361  0.000000  0.000000
2 -0.315750  0.000000 -0.855043
3 -1.092719  0.000000 -1.788691
4 -1.869576  0.164367  1.095719
5 -1.535485  0.712377 -1.107669
6 -0.345499 -1.535528 -0.281768

In [19]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [20]:
data = pd.DataFrame({'k1':['one','two']*3+['two']
                    'k2':[1,1,2,3,3,4,4]})
data

SyntaxError: invalid syntax (<ipython-input-20-e265c07ff8a2>, line 2)

In [21]:
data = pd.DataFrame({'k1':['one','two']*3+['two']'k2': [1, 1, 2, 3, 3, 4, 4]})
data

SyntaxError: invalid syntax (<ipython-input-21-33348d134fe4>, line 1)

In [22]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two']
,
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [1]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami', 'honey ham','nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3,5, 6]})]})
data

SyntaxError: invalid syntax (<ipython-input-1-517374ff839c>, line 2)

In [2]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami', 'honey ham','nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3,5, 6]})
data

NameError: name 'pd' is not defined

In [3]:
import pandas as pd
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami', 'honey ham','nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3,5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [5]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [6]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [7]:
data = pd.Serise([1.,-999.,2.,-999.,-1000.,3.])
data

AttributeError: module 'pandas' has no attribute 'Serise'

In [8]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [9]:
data.replace(-999,np.nan)

NameError: name 'np' is not defined

In [10]:
import numpy
data.replace(-999,np.nan)

NameError: name 'np' is not defined

In [11]:
import numpy as np
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [12]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [13]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [14]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [15]:
transform = lambda x:x[:4].upper()
data.index.map(transform)
Index(['OHIO', 'COLO', 'NEW '], dtype='object')
data.index = data.index.map(transform)
data

NameError: name 'Index' is not defined

In [16]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [17]:
cats.codes
array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)
cats.categories
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
closed='right',
dtype='interval[int64]')

SyntaxError: invalid syntax (<ipython-input-17-eeb4b61ca4c1>, line 4)

In [18]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [19]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([3, 4, 1, 0, 2])

In [20]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [21]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [22]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

In [23]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

1    7
1    7
4    4
0    5
0    5
4    4
1    7
2   -1
2   -1
2   -1
dtype: int64

In [25]:
val = 'a,v,   guido'
val.split(',')
['a','b','guido']

['a', 'b', 'guido']

In [26]:
val = 'a,v,   guido'
val.split(',')
['a','b','guido']

['a', 'b', 'guido']

In [27]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'v', 'guido']

In [28]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']